
/*
Question: Express JS কি?
=========================
Express.js হলো একটি মোডার্ন ওয়েব ফ্রেমওয়ার্ক, যা Node.js এর উপর নির্মিত। এটি বেশিরভাগ ওয়েব অ্যাপ্লিকেশন এবং RESTful API তৈরি করতে ব্যবহৃত হয়।
Express.js দ্বারা ওয়েব অ্যাপ্লিকেশন বা API তৈরি করা খুবই সহজ এবং দ্রুত।
Express.js এর কিছু গুরুত্বপূর্ণ বৈশিষ্ট্য এবং ব্যবহারের ক্ষেত্রগুলি হলো:

1-> মিনিমালিস্টিক: Express হলো একটি মিনিমালিস্টিক ফ্রেমওয়ার্ক, যা অল্প কোডে বোঝানো এবং ব্যবহার করা যায়।
2-> মিডলওয়্যার: Express.js এ মিডলওয়্যার ব্যবহার করে রিকোয়েস্ট ও রেসপন্স প্রক্রিয়া করতে সহায়ক। এটি একটি ফাংশন চেইন বা পাইপলাইন আকারে কাজ করে,
যা অ্যাপ্লিকেশনের রিকোয়েস্ট প্রক্রিয়ার জন্য মিডলওয়্যার যোগ করতে দেয়।
3-> রাউটিং: Express বিশেষভাবে রাউটিং বিষয়ে সুপারিশ করে। এটি রিকোয়েস্ট পাঠাতে বা রিকোয়েস্টের ধরনের উপর ভিত্তি করে কাজ করে।
4-> টেমপ্লেটিং ইঞ্জিন: Express.js টেমপ্লেটিং ইঞ্জিন ব্যবহার করতে অনুমতি দেয়, যেটি পেজে ডাটা দেখানোর জন্য ব্যবহার করা হয়।
5-> ওয়েব অ্যাপ্লিকেশন তৈরি: Express.js দিয়ে ওয়েব অ্যাপ্লিকেশন তৈরি করা হয় যেটি দ্রুত এবং কাজ করতে পারে।

What is express:
• This is a server side web framework for node

Uses:
• To Develop Server Side Rest API For Mobile, Desktop, Web Applications and IOT devices
• Using template engine with express you can develop complete web site or web application too.
• You can use React, Vue or Angular with express to develop complete web site or web application

What will be our learning strategy
===================================
1. Express Rest API Development
2. Working with template engine and express together
3. Working with react and express together
4. Deploy & Testing With Real server

Question: Express JS দ্বারা কোন কোন ধরনের ওয়েবসাইট তৈরি করা সম্ভব?
==================================================================
এই বৈশিষ্ট্যগুলির জন্য Express.js বিশেষভাবে একটি পপুলার ওয়েব ফ্রেমওয়ার্ক হয়ে উঠেছে এবং এটি বিশেষভাবে Node.js উপর ভিত্তি করে সুপারিশ করা হয়।
Express.js দিয়ে বিভিন্ন ধরনের ওয়েব অ্যাপ্লিকেশন, RESTful API, মাইক্রোসার্ভিস, ব্লগ, এবং আরো অনেক কিছু তৈরি করা সহজ হয়েছে।
Express.js দ্বারা আপনি বিভিন্ন ধরনের ওয়েবসাইট তৈরি করতে পারেন। এটি একটি ওয়েব ফ্রেমওয়ার্ক যা একটি সহজ, পাওয়ারফুল, এবং উন্নত একটি প্ল্যাটফর্ম সরবরাহ করে।
নিম্নলিখিত কিছু ধরনের ওয়েবসাইট তৈরি করার জন্য Express.js ব্যবহার করা যেতে পারে:

1-> পাবলিক ফেসেস ওয়েবসাইট: Express.js ব্যবহার করে আপনি স্ট্যাটিক ফাইলগুলি সরবরাহ করতে পারেন, যেমন HTML, CSS, JavaScript এবং ছবি
2-> ব্লগ: Express.js ব্যবহার করে একটি ব্লগ তৈরি করা যেতে পারে, যেখানে আপনি নতুন পোস্ট তৈরি এবং প্রকাশ করতে পারেন।
3-> ই-কমার্স সাইট: Express.js ব্যবহার করে আপনি ই-কমার্স সাইট তৈরি করতে পারেন এবং পণ্য বিক্রি করতে পারেন।
4-> এপ্লিকেশন ড্যাশবোর্ড: Express.js দিয়ে আপনি একটি ড্যাশবোর্ড তৈরি করতে পারেন যেখানে আপনি সার্ভারের সাথে ইন্টারঅ্যাক্ট করতে পারেন এবং ডেটা ম্যানেজ করতে পারেন।
5-> সোশ্যাল নেটওয়ার্ক: Express.js ব্যবহার করে আপনি একটি সোশ্যাল নেটওয়ার্ক তৈরি করতে পারেন যেখানে ব্যবহারকারীরা এক অপরের সাথে ইন্টারঅ্যাক্ট করতে পারে।
*/